{
  "title": "Notice of Discontinuance",
  "pages": [
    {
      "name": "Notice of Discontinuance",
      "description": "If you have filed an Application About a Family Law Matter, reply or counter application with the court and you no longer want to have the court make a decision about it, you can file a Notice of Discontinuance to stop it from continuing before the court.<br><br>If an application, reply or counter application is discontinued, it means that it has been abandoned. The party or the court cannot take any further action on the application or counter application but it does not cancel anything that has already been done in court.<br><br>You can only discontinue your own application, reply or counter application. If the other party has their own application, reply or counter application, it is not affected. This means you may still have to go to court about their document. If the other party also wants to discontinue their application, reply or counter application, they must also complete a Notice of Discontinuance.",
      "elements": [
        {
          "type": "panel",
          "name": "ApplicantPanel",
          "elements": [
            {
              "type": "infotext",
              "name": "ExplanationDiscontinuance",
              "title": "<b>If you are filing a Notice of Discontinuance, it is important for you to undertand the effect it may have.</b><br>Some applications have a limitation period for when you must apply. If you discontinue an application, you are not prevented from filing a new application about the same family law matter at a later date unless the judge orders otherwise.<br>If you think you may want to file your application at a later date, check to make sure you will still be within the limitation periods set out in sections <a target='_blank' href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_07#section147'>147 (4) (b) <i>[duty to provide support for child]</i></a> and 198 (2) [time limits] of the Family Law Act before you file your Notice of Discontinuance.<br>If you are unsure if a limitation period applies to your application, talk to a lawyer. ",
              "titleLocation": "hidden"
            },
            {
              "type": "helptext",
              "name": "FAQLegalAdvice",
              "title": "Where can I get legal assistance?",
              "titleLocation": "hidden",              
              "body": "Understanding the law and making sure you get correct information is important. If you get the wrong information or do not know how the law applies to your situation, it can be harder to resolve your case. Getting advice from a lawyer can help.<br/><br/><b>Lawyers:</b> To find a lawyer or to have a free consultation with a lawyer for up to 30 minutes, contact the <a href='https://www.cbabc.org/For-the-Public/Lawyer-Referral-Service' target='blank'>Lawyer Referral Service</a> at 1-800-663-1919<br/><br/><b>Legal Aid, Duty Counsel and Family Advice Lawyers:</b> To find out if you qualify for free legal advice or representation, contact <a href='https://lss.bc.ca/legal_aid/howToApply.php' target=\"blank\">Legal Aid BC</a> at <p style='display:inline-block'>1-866-577-2525.</p><br/><b>Legal Services and Resources:</b> Visit <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">Clicklaw</a> at <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">www.clicklaw.bc.ca/helpmap</a> to find other free and low-cost legal services in your community"             
            },
            {
              "type": "yesno",
              "name": "Filed",
              "title": "Have you filed an Application About a Family Law Matter, reply or counter application that you want to discontinue?",
              "description": "You can discontinue <b>all</b> or <b>part</b> of your application, reply or counter application. You will be asked for this information later.",
              "isRequired": true
            },            
            {
              "type": "infotext",
              "name": "ExplanationNotFiled",
              "visible": false,
              "visibleIf": "{Filed} = 'n'",
              "title": "If you want to cancel an order that has already been made in court because there has been a change in needs or circumstances, you can apply to the court to cancel the order by filing an application. Go back to Step 1 and select Apply for an Order.<br>If the other party filed an application, reply or counter application that you want discontinued and they also agree it should be discontinued, they will have to file the Notice of Discontinuance.",
              "titleLocation": "hidden"
            },
            {
              "type": "panel",
              "name": "ApplicantContactPanel",
              "visible": false,
              "visibleIf": "{Filed} = 'y'",
              "elements": [
                {
                  "type": "personname",
                  "name": "ApplicantName",
                  "title": "What is your full name?",
                  "description": "This is the name of the person whose application, reply or counter application is being discontinued. Copy the name from any filed court document.",                  
                  "isRequired": true,              
                  "defaultSubstitution": "(Applicant Name)",
                  "descFirstName": "First Name is also known as Given Name",
                  "descMiddleName": "If you have more than one Middle Name, write them all in this box with spaces separating your Middle Names",
                  "descLastName": "Last Name is also known as Family Name or Surname"
                },

                {
                  "type": "panel",
                  "name": "ContactInformationOtherPartyPanel",             
                  "elements": [
                    {
                      "isRequired": true,  
                      "type": "paneldynamic",
                      "name": "otherPartyInfoDis",
                      "title": "<div style = 'color: #556077; font-size: 1.5em; line-height: 1.2;' > What is the full name of the other party? </b>",
                      "description": "Copy the name from the filed document.",                            
                      "templateElements": [
                        {
                          "type": "personname",
                          "name": "name",
                          "title": " ",
                          "titleLocation": "hidden"
                        }
                      ]
                    }
                  ]
                },
                {
                  "type": "checkbox",
                  "name": "ExplanationServe",                  
                  "title": "Notice",
                  "description": "I understand <b>I must give notice</b> of this notice of discontinuance to each other party. To give notice, they must be served with a copy of the notice of discontinuance before the earlier of the following dates:<br<br><ol><li><b>14 days after you</b> filed the notice of discontinuance</li><li>The <b>date of the next scheduled court appearance.</b></li></ol>",
                  "choices": [
                    {
                      "value": "confirm",
                      "text": "I confirm"
                    }
                  ],
                  "isRequired": true
                },
                {
                  "type": "checkbox",
                  "name": "discontinuanceDocs",
                  "title": "Which document do you want to discontinue (all or part of)?",
                  "description": "Note: A counter application is a separate part of your reply to an application about a family law matter. If you want to discontinue your reply <b>and</b> your counter application, select both.<br><br>Select each option that applies. You may choose more than one.",
                  "choices": [
                      {
                        "value": "form3",
                        "text": "Application about a Family Law Matter (Form 3)"
                      },
                      {
                        "value": "form6",
                        "text": "Reply to an Application About a Family Law Matter (Form 6)"
                      },
                      {
                        "value": "form6Counter",
                        "text": "Counter Application About a Family Law Matter (Form 6 counter application)"
                      },
                      {
                        "value": "form8",
                        "text": "Reply to a Counter Application (Form 8)"
                      }
                  ],
                  "isRequired": true
                }                 
              ]
            } 
          ]
        }
      ],
      "title": "Notice of Discontinuance"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}