{
  "title": "Reply Appointing a Guardian of a Child",
  "pages": [
    {
      "name": "Reply Appointing a Guardian of a Child",
      "elements": [
        {
          "type": "infotext",
          "name": "appointingGuardianshipDescription",
          "title": "The other party has made an application to be appointed as a guardian of a child.<br><br>Guardianship is who is responsible for a child. Only guardians can have parental responsibilities and parenting time with a child.<br><br>The <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01' target='_blank'>Family Law Act</a> provides that generally both parents will continue to be guardians even if the parents are not together, and each will have parenting time and parental responsibilities. This does not mean that parents must have equal time or responsibility for a child. An agreement or order about parenting arrangements can make all the child’s guardians share parenting responsibilities or parenting time. Or it can make only one or more guardians responsible for parenting decisions and time with the child to the exclusion of all other guardians.<br><br>Anyone who wants to become a guardian can apply, including a parent who is not a guardian or anyone else (even if they are not related to the child).<br><br>The details of the order the other party is asking for can be found in <b>Schedule 7 – Appointing a Guardian of a Child</b> of their Application About a Family Law Matter. You will need to refer to their application for these next questions.",
          "messageStyle": "inline",
          "titleLocation": "hidden"
        },
        {
          "type": "panel",
          "name": "AppointingGuardianshipPanel",
          "elements": [
            {
              "type": "yesno",
              "name": "moreThanOneChild",
              "title": "Is the other party’s application to be appointed a guardian about more than one child?",
              "description": "Look at <b>Question 1</b> on <b>Schedule 7 – Appointing a Guardian of a Child</b> of the other party’s Application About a Family Law Matter. If more than one child is listed, the application is about more than one child.",
              "isRequired": true
            },
            {
              "type": "radiogroup",
              "name": "agreeCourtOrderChild",
              "title": "Select the correct statement below:",            
              "isRequired": true,
              "visible": false,
              "visibleIf": "{moreThanOneChild} = 'y'",              
              "choices": [
                {"value": "agreeAll", "text": "I <b>agree</b> the other party should be appointed as a guardian of <b>all</b> the children the application is about"},
                {"value": "agreeNotAll", "text": "I <b>agree</b> the other party should be appointed as a guardian of <b>at least one</b> child the application is about but <b>not all</b> the children"},
                {"value": "disagree", "text": "I <b>do not agree</b> the other party should be appointed as a guardian of <b>any</b> of the children the application is about"}                
              ]
            },          
            {
              "type": "yesno",
              "name": "agreeCourtOrder",
              "title": "Do you agree the court should appoint the other party as a guardian of the child?",
              "description": "Should the court make the order?",
              "isRequired": true,
              "visible": false,
              "visibleIf": "{moreThanOneChild} = 'n'"
            }
          ]
        }
   
      ],
      "title": "Reply Appointing a Guardian of a Child"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}