{
  "title": "Spousal Support",
  "pages": [
    {
      "name": "Spousal Support",
      "description": "<a href=\"https://www2.gov.bc.ca/gov/content/life-events/divorce/family-justice/family-law/spousal-support/what-is\" target=\"_blank\">Spousal support</a> is money that one spouse pays to another spouse for their financial support after separation.  It is different from child support. The purpose of spousal support is to help meet the on-going financial needs of a financially dependent spouse for a defined time.<br><br>A person is only entitled to spousal support in certain situations.  It is not a right in every case.  There are rules under the <a href=\"https://www.bclaws.gov.bc.ca/civix/document/id/lc/statreg/11025_00\" target=\"_blank\"> Family Law Act </a>about what makes you a spouse and when you can ask for an order for spousal support.<br><br>You can apply for spousal support if:<br><ul><li>you are a spouse because:</li><ul><li>You were married</li><li>You lived together in a marriage-like relationship for at least two years, or</li><li>You lived in a marriage-like relationship for less than two years, but you have a child together</li></ul><li>you can prove entitlement to the court for spousal support, and</li><li>you are applying in time (Married spouses must start a court proceeding claiming spousal support within two years of the date of their divorce or an order annulling their marriage. Unmarried spouses must start a court proceeding within two years of the date of their separation. We recommend that you talk to a lawyer if you are not sure about the timing of your application.)</li></ul><br><br>For more information about spousal support and referrals to other spousal support resources, visit the <a href=\"https://www2.gov.bc.ca/gov/content/life-events/divorce/family-justice/family-law/spousal-support/more-info\" target=\"blank\">BC Government website</a> at <a href=\"http://www.gov.bc.ca/\" target=\"blank\">www.gov.bc.ca</a>.<br><br>We recommend that you talk to a lawyer before you make any final decisions about spousal support.",
      "elements": [
        {
          "type": "helptext",
          "name": "FAQLegalAdvice",
          "title": "Where can I get legal assistance?",
          "titleLocation": "hidden",
          "body": "Understanding the law and making sure you get correct information is important. If you get the wrong information or do not know how the law applies to your situation, it can be harder to resolve your case. Getting advice from a lawyer can help.<br/><br/><b>Lawyers:</b> To find a lawyer or to have a free consultation with a lawyer for up to 30 minutes, contact the <a href='https://www.cbabc.org/For-the-Public/Lawyer-Referral-Service' target='blank'>Lawyer Referral Service</a> at 1-800-663-1919<br/><br/><b>Legal Aid, Duty Counsel and Family Advice Lawyers:</b> To find out if you qualify for free legal advice or representation, contact <a href='https://lss.bc.ca/legal_aid/howToApply.php' target=\"blank\">Legal Aid BC</a> at <p style='display:inline-block'>1-866-577-2525.</p><br/><br/><b>Legal Services and Resources:</b> Visit <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">Clicklaw</a> at <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">www.clicklaw.bc.ca/helpmap</a> to find other free and low-cost legal services in your community"
        },
        {
          "type": "panel",
          "name": "ApplicantPanel",
          "isRequired": true,
          "elements": [
            {
              "type": "checkbox",
              "name": "listOfSupportPayees",
              "title": "I am applying for spousal support to be paid by:",
              "description": "Select from the list below.",
              "isRequired": true,
              "choices": []
            },
            {
              "type": "checkbox",
              "name": "listOfReasons",
              "description": "Entitlement to spousal support is determined in consideration of the objectives under section 161 of the <a href=\"https://www.bclaws.gov.bc.ca/civix/document/id/lc/statreg/11025_00\" target=\"blank\">Family Law Act</a> as listed below. Be prepared to provide evidence to help the court determine if a spouse is entitled to spousal support.<br><br>Select all options that apply. ",
              "title": "I believe that {Payee} is entitled to spousal support for the following reason:",
              "isRequired": true,
              "visible": false,
              "visibleIf": "{listOfSupportPayees} notempty",
              "choices": [
                "There are economic advantages or disadvantages to the spouses arising from the relationship or breakdown of the relationship",
                "To share the financial consequences arising from caring for the children during the relationship, beyond the duty to provide support for the child",
                "To relieve economic hardship of the spouses arising from the breakdown of the relationship",
                "To help each spouse become financially independent within a reasonable period"
              ]
            },
            {
              "type": "comment",
              "name": "currentSupport",
              "visible": false,
              "visibleIf": "{listOfSupportPayees} notempty",
              "title": "Please describe the current support arrangements.",
              "description": "You do not need to use any special wording. Just explain to the court how the spouse you believe is entitled to support is currently being looked after financially. Include:<ul><li>how much money you are receiving or paying for the support of the spouse</li><li>how often payments are/were being made</li><li>when did these payments begin or stop",
              "isRequired": true
            }
          ]
        }
      ],
      "title": "Spousal Support"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}