{
    "affidavit": "An affidavit is a document that contains facts that you swear under oath or affirm to be true. It is your story that you are telling the court.",
    "best interests of the child": "The 'best interests of the child' is a test that the court uses to make decisions about children.  Before making a decision, both parents and courts must consider the child’s physical, psychological and emotional safety, security and well-being. The <i>Family Law Act section 37</i> includes the following considerations:<ol style='list-style-type:lower-alpha'><li>the child's health and emotional well-being;</li><li>the child's views, unless it would be inappropriate to consider them;</li><li>the nature and strength of the relationships between the child and significant persons in the child's life;</li><li>the history of the child's care;</li><li>the child's need for stability, given the child's age and stage of development;</li><li>the ability of each person who is a guardian or seeks guardianship of the child, or who has or seeks parental responsibilities, parenting time or contact with the child, to exercise his or her responsibilities;</li><li>the impact of any family violence on the child's safety, security or well-being, whether the family violence is directed toward the child or another family member;</li><li>whether the actions of a person responsible for family violence indicate that the person may be impaired in his or her ability to care for the child and meet the child's needs;</li><li>the appropriateness of an arrangement that would require the child's guardians to cooperate on issues affecting the child, including whether requiring cooperation would increase any risks to the safety, security or well-being of the child or other family members;</li><li>any civil or criminal proceeding relevant to the child's safety, security or well-being.</li></ol>",
    "contact with a child": "The time a child spends with someone who is not their guardian.  This person could include a parent who is not a guardian to a child, or other people, like grandparents.",
    "child support": "The amount of money a parent or guardian pays to another parent or guardian to help care for the child(ren).",
    "family law matter": "A case about one or more of the following: parenting arrangements, including parental responsibilities and parenting time, child support, contact with a child, guardianship of a child, spousal support",
    "family law act protection order": "A Family Law Act Protection Order is a protection order from family court that can protect you from a family member. It is a list of conditions that may include: no visits to your home or workplace, no phone calls, emails, or letters, and no messages through a friend or relative. If the family member doesn't follow the conditions, they may face criminal charges.\n\n  [Click here for more information](https://www2.gov.bc.ca/gov/content/life-events/divorce/family-justice/keeping-your-family-safe/protection-order). (This link will open in a new tab.)",
    "family member": "With respect to you, means your spouse or former spouse, a person who lives or lived with you in a marriage-like relationship, your child’s parent or legal guardian, a person who lives with and is related to any of the people already listed, a relative of yours who lives with you, and your own child.",
    "family violence": "Defined term that includes<ol style='list-style-type:lower-alpha'><li>physical abuse of a family member, including forced confinement or deprivation of the necessities of life, but not including the use of reasonable force to protect oneself or others from harm,</li><li>sexual abuse of a family member,</li><li>attempts to physically or sexually abuse a family member,</li><li>psychological or emotional abuse of a family member, including<ol style='list-style-type:lower-roman'><li>intimidation, harassment, coercion or threats, including threats respecting other persons, pets or property,</li><li>unreasonable restrictions on, or prevention of, a family member’s financial or personal autonomy,</li><li>stalking or following of the family member, and</li><li>intentional damage to property, and</li></ol></li><li>in the case of a child, direct or indirect exposure to family violence.</li></ol>",
    "legal guardian": "A legal guardian is someone who was appointed by a court to be allowed to make decisions for a child under the age of 19.",
    "legal guardians": "A legal guardian is someone who was appointed by a court to be allowed to make decisions for a child under the age of 19.",
    "order":  "An order is a court decision made by a judge. It usually includes a list of terms or conditions that set out what you and/or the other party must do or not do. Orders are sometimes called decisions or judgments.",
    "Orders": "An order is a court decision made by a judge. It usually includes a list of terms or conditions that set out what you and/or the other party must do or not do. Orders are sometimes called decisions or judgments.",
    "peace bond": "A peace bond is a protection order made under the [Criminal Code](http://laws-lois.justice.gc.ca/eng/acts/C-46/) of Canada. It can  protect you from anyone, including someone who is not your family member. It is a list of conditions that may include: no visits to your home or workplace, no phone calls, emails, letters, or messages through a friend or relative. If the person doesn't follow the conditions, they may face criminal charges.\n\n  [Click here for more information](https://www.justice.gc.ca/eng/cj-jp/victims-victimes/report-signale/peace-ordre.html).  (This link will open in a new tab.)",
    "protection order": "A protection order is the order made by a court to help protect one family member from another family member where there is a risk of family violence.",
    "support": "Support is money paid by one person to another, after their relationship ends, to provide for the financial needs of a spouse or children.",
    "unsafe": "When a family member makes you feel unsafe, this is called Family Violence. Family violence includes many things such as:\n - physical abuse (or attempted abuse)\n  - emotional or mental abuse (stalking, threats, intimidation or harassment)\n - sexual abuse (or attempted abuse)\n - denying food or other basic needs\n  - children being exposed to family violence\n\n[Click here for more information for what counts as Family Violence](http://www.justice.gc.ca/eng/cj-jp/fv-vf/laws-lois.html).  (This link will open in a new tab.)",
    "weapon": "A *weapon* means any thing used, designed to be used or intended for use\n\n  - (a) in causing death or injury to any person, or\n  - (b) for the purpose of threatening or intimidating any person\n  \n  and, without restricting the generality of the foregoing, includes a firearm and, for the purposes of sections 88, 267 and 272, any thing used, designed to be used or intended for use in binding or tying up a person against their will; (arme)\n  Click [here for more information](http://laws-lois.justice.gc.ca/eng/acts/C-46/page-1.html).",
    "written agreement": "An agreement that is in writing and signed by all parties.",
    "written agreements": "A written agreement is a document that is signed by you and an other person.",
    "split parenting": "Split parenting is when each parent has at least one child living with them most of the time.",
    "shared parenting": "Shared parenting is when both parents have a similar amount of parenting time with a child. It is often described as shared if each parent has at least 40% of the parenting time with a child.",
    "hardship": "Sometimes the amount for child support determined under the guidelines, when combined with other circumstances, may be hard for you to pay or for you to be able to support your child.<br><br>The Federal Child Support Guidelines include the following list of circumstances:<ul><li>You have an unusual or excessive amount of debt you incurred to support the family prior to separation or to earn a living</li><li>You have unusually high expenses to exercise parenting time or contact with the child(ren)</li><li>You have a legal duty to support another person, such as a person who is ill or disabled or a former spouse</li><li>You have a legal duty to support a dependant child from another relationship</li></ul>",
    "guardian": "A person who is responsible for a child. Only guardians have parental responsibilities and parenting time with a child.  Most times, a parent is a guardian of their child, except where they have never lived with their child. A parent can be added or removed as a guardian by agreement or court order. A non-parent can become a guardian of a child through a court order.",
    "guardianship of a child": "To have guardianship of a child means that a person is responsible for caring for and raising a child, and, making decisions about that child.",
    "notice": "The period of time between the day that the other party is served with a copy of the court documents and the day that the application is scheduled for court is called the \"notice period\" or \"notice\".",
    "parental responsibilities": "Guardians make decisions about their child, including daily care and supervision, education, medical treatment, receiving information about the child from others, and protecting the child’s legal and financial interests.  These are parental responsibilities.  Guardians share parental responsibilities unless they have a court order or agreement that says otherwise. The <i>Family Law Act section 41</i> provides the following list of parental responsibilities:<div><ol style='list-style-type:lower-alpha'><li>making day-to-day decisions affecting the child and having day-to-day care, control and supervision of the child;</li><li>making decisions respecting where the child will reside;</li><li>making decisions respecting with whom the child will live and associate;</li><li>making decisions respecting the child's education and participation in extracurricular activities, including the nature, extent and location;</li><li>making decisions respecting the child's cultural, linguistic, religious and spiritual upbringing and heritage, including, if the child is an aboriginal child, the child's aboriginal identity;</li><li>subject to section 17 of the Infants Act, giving, refusing or withdrawing consent to medical, dental and other health-related treatments for the child;</li><li>applying for a passport, licence, permit, benefit, privilege or other thing for the child;</li><li>giving, refusing or withdrawing consent for the child, if consent is required;</li><li>receiving and responding to any notice that a parent or guardian is entitled or required by law to receive;</li><div><li>requesting and receiving from third parties health, education or other information respecting the child;</li></div><div><li>subject to any applicable provincial legislation,<ol style='list-style-type:lower-roman'><li>starting, defending, compromising or settling any proceeding relating to the child, and</li><li>identifying, advancing and protecting the child's legal and financial interests;</li></ol></li></div><div><li>exercising any other responsibilities reasonably necessary to nurture the child's development.</li></div></ol></div>",
    "parenting time": "The time a guardian spends with a child.",
    "parenting arrangements": "Parenting arrangements set out how guardians share parenting time and parental responsibilities after separation. When you make parenting arrangements after a separation, the law says you must only consider the best interests of the child.",
    "priority parenting matter": "A priority parenting matter is a decision about a child or children that requires the agreement of each of the child’s guardians or an order from the court and it is a priority to get the order separately from any family law matter order(s). The priority parenting matters are a limited list that includes the following:<ol style='list-style-type:lower-alpha'><li>giving, refusing or withdrawing consent, by a guardian, to medical, dental or other health-related treatments for a child, if delay will result in risk to the child’s health;</li><li>applying, by a guardian, for <ol style='list-style-type:lower-roman'><li>a passport, licence, permit, benefit, privilege or other thing for a child, if delay will result in risk of harm to the child’s physical, psychological or emotional safety, security or well-being, or</li><li>travel with a child or participation by a child in an activity if consent to the travel or activity is required and is alleged to have been wrongfully denied;</li></ol></li><li>relating to change in location of a child’s residence, or a guardian’s plan to change the location of a child’s residence, if <ol style='list-style-type:lower-roman'><li>no written agreement or order respecting parenting arrangements applies in respect of the child, and</li><li>the change of residence can reasonably be expected to have a significant impact on the child’s relationship with another guardian;</li></ol></li><li>relating to the removal of a child under section 64 [orders to prevent removal of child] of the Family Law Act;</li><li>determining matters relating to interjurisdictional issues under section 74 (2) (c) [determining whether to act under Part 4 – Care of and Time with Children] of the Family Law Act;</li><li>relating to the alleged wrongful removal of a child under section 77 (2)[wrongful removal of child] of the Family Law Act;</li><li>relating to the return of a child alleged to have been wrongfully removed or retained under the Convention on the Civil Aspects of International Child Abduction signed at the Hague on October 25, 1980;</li></ol>",
    "priority parenting matters": "A priority parenting matter is a decision about a child or children that requires the agreement of each of the child’s guardians or an order from the court and it is a priority to get the order separately from any family law matter order(s). The priority parenting matters are a limited list that includes the following:<ol style='list-style-type:lower-alpha'><li>giving, refusing or withdrawing consent, by a guardian, to medical, dental or other health-related treatments for a child, if delay will result in risk to the child’s health;</li><li>applying, by a guardian, for <ol style='list-style-type:lower-roman'><li>a passport, licence, permit, benefit, privilege or other thing for a child, if delay will result in risk of harm to the child’s physical, psychological or emotional safety, security or well-being, or</li><li>travel with a child or participation by a child in an activity if consent to the travel or activity is required and is alleged to have been wrongfully denied;</li></ol></li><li>relating to change in location of a child’s residence, or a guardian’s plan to change the location of a child’s residence, if <ol style='list-style-type:lower-roman'><li>no written agreement or order respecting parenting arrangements applies in respect of the child, and</li><li>the change of residence can reasonably be expected to have a significant impact on the child’s relationship with another guardian;</li></ol></li><li>relating to the removal of a child under section 64 [orders to prevent removal of child] of the Family Law Act;</li><li>determining matters relating to interjurisdictional issues under section 74 (2) (c) [determining whether to act under Part 4 – Care of and Time with Children] of the Family Law Act;</li><li>relating to the alleged wrongful removal of a child under section 77 (2)[wrongful removal of child] of the Family Law Act;</li><li>relating to the return of a child alleged to have been wrongfully removed or retained under the Convention on the Civil Aspects of International Child Abduction signed at the Hague on October 25, 1980;</li></ol>",
    "relocation": "A change in the location of the residence of a child or child’s guardian that can reasonably be expected to have a significant impact on the child’s relationship with a guardian or another person who has a significant role in the child’s life. Relocation of a child occurs when a guardian has decision making responsibility about where a child resides as part of their parenting arrangements. If there is no order or agreement in place between the guardians about parenting arrangements for the child, an application may be made about parenting arrangements for changes to a child’s residence.",
    "spousal support": "Money that one spouse pays to another spouse for their financial support after separation.  A person is not entitled to spousal support in every case.",
    "spouse": "A spouse is someone who is married to the applicant.\n\n A spouse is also someone who has been living together, for at least two years, in a marriage-like relationship with the applicant. This type of relationship is also known as common-law marriage.",
    "Consensual dispute resolution": "Consensual dispute resolution may include:<ul><li>Mediation with a family law mediator</li><li>Participation in a collaborative law process</li><li>Facilitated negotiation of a child support or spousal support matter with a child support officer</li></ul>",
    "swear or affirm": "To swear or affirm an affidavit, you must meet with a commissioner for taking oaths. The commissioner (often a lawyer, notary public or registry clerk) will check your photo id to make sure you are who you say you are, ask you if you understand the contents of your affidavit, then ask you to swear under oath or affirm (non-religious promise) that the contents are true. The commissioner will then watch you sign the document before signing it themselves. After you swear or affirm, the affidavit is evidence of the facts it sets out, just as if you took the stand in a courtroom.",
    "court file number": "Copy this information from top right corner of the Notice to Resolve a Family Law Matter or other document filed with the court.<br>If you don’t have an existing court file, registry staff will give your case a file number when you file this document.",
    "registry notice": "registry note identifying where additional information or corrections are required",
    "split":"You split parenting time of your children if:<ul><li>you have more than one child; and</li><li>you each have the majority of parenting time with at least one of the children</li></ul>For child support purposes, split parenting time refers to the time the child spends with each parent. It does not refer to who has responsibility to make major decisions about the child.",
    "shared":"You share parenting time if your child or children spend at least 40% of the time with each of you in a year.<br><br>For child support purposes, shared parenting time refers to the time the child spends with each parent. It does not refer to who has responsibility to make major decisions about the child.",
    "special and extraordinary expenses":"Special and extraordinary expenses are costs of raising a child that go above and beyond what is covered by the guideline table amount for child support.",
    "undue hardship":"Undue hardship is when paying or receiving the guideline table amount for child support would make the party or the child suffer financially to an excessive amount when combined with other circumstances. Either parent can claim undue hardship.",
    "facts":"Facts are things you know to be true, that actually happened, or that have been proven to exist. Facts are not opinions or things you think are true.",
    "extraordinary":"An expense for education or extracurricular activities is <b>extraordinary</b> only if:<ul><li>it is more than you can reasonably pay based on your income and the amount of child support you receive</li><li>it is not more than you can reasonably pay, but it is extraordinary when you take into account:</li><ul><li>your income and the amount of child support you receive</li><li>the nature and number of educational programs and extracurricular activities</li><li>the overall cost of the educational programs and activities</li><li>any special needs and talents of the child</li><li>any other similar factors that are considered relevant</li></ul></ul>",
    "interjurisdictional issues": "Interjurisdictional issues are issues that involve more than one jurisdiction. For example, British Columbia and another province or territory, or another country.",
    "section 74(2)(c)": "S. 74(2)(c) states that a court may make an order under this Part respecting guardianship, parenting arrangements or contact with a child only if the child is physically present in British Columbia and the court is satisfied that the child would suffer serious harm if the child were to remain with, or be returned to, the child’s guardian or to be removed from British Columbia.",
    "1980 hague convention": "The Convention on the Civil Aspects of International Child Abduction signed at the Hague on October 25, 1980, is also known as the Hague Convention. It is a treaty developed to assist with the return of a child internationally abducted by a parent from one member country to another.",
    "any other requirement": "Any other requirement includes any time the rules say a person or party <b>must</b> do something. This may include:<br>Filing at a specific court registry<br>Meeting requirements before you can carry on with your court application at an early resolution or family justice registry<br>Filing a document by a specific time or without being able to complete it fully",
    "order made in my absence": "An order may be made in the absence of a party (without the party being at the court appearance). If you were not in court when the order was made, you can apply to change, suspend or cancel the order but only if:<br>You apply within a reasonable time <b>and</b><br>You did not receive notice of the application or court appearance, <b>or</b><br>There is a good reason to change, suspend or cancel the order.",
    "other person": "The other person is someone who is not a party who may be directly affected by the order such as a person you need information or documents from.",
    "consent": "Consent means that a person agrees the court should make the order you are asking for. They are voluntarily giving their approval for the order to be made.",
    "determination of a parenting coordinator": "A written decision of a parenting coordinator about parenting arrangements or contact with a child that you and the other parent or guardian must follow.",
    "expenses": "Expenses are payments for things like travel, additional professional fees or childcare that you may have if someone doesn’t follow a court order or misuses the court process. The expenses must be reasonably and necessarily incurred meaning they are normal and expected.",
    "arrears": "Arrears are the amount of past child support or spousal support payments that have not been made by their due date. The support is unpaid or past due.",
    "authority": "Authority is the official permission or right to do something. The authority to do something can come from laws or from another person for example a contract or consent.",
    "failure to comply": "Failure to comply means someone hasn’t done what they were supposed to do. A person who has not met the requirements of a court order or the Rules has failed to comply with those requirements.",
    "certified copy": "A certified copy is a copy of the original order from the other court, usually a photocopy, that has been endorsed using a stamp or certificate by the court to say that it is a true copy of the original.</br>If you do not have a certified copy of the order, you will need to contact the original court location to get a certified copy from them."
}