{
  "title": "About the existing order or written agreement",
  "pages": [
    {
      "name": "About the existing order or written agreement",
      "elements": [
        {
          "type": "panel",
          "name": "ExistingTypeDetailsPanel",
          "visible": false,
          "visibleIf": "({existingType} = 'ExistingOrder') or ({existingType} = 'ExistingAgreement')",
          "elements": [
            {
              "type": "text",
              "name": "orderDate",
              "title": "Please provide the date the court made the order.",
              "description": "The date should be referenced in the preamble on the order. For example, “Before the Honourable Judge Jones on May 1, 2016”. The date on the court stamp doesn’t always match the date the order was made.",
              "isRequired": true,
              "inputType": "date",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingOrder'"
            },
            {
              "type": "text",
              "name": "agreementDate",
              "title": "Please provide the date the written agreement was signed.",
              "isRequired": true,
              "inputType": "date",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingAgreement'"
            },
            {
              "type": "infotext",
              "name": "ChangeOrderExplanationFAQ",
              "title": "Family dynamics change and children grow up. A child support order that was made in the past may not make sense anymore. The court can only change or cancel an order if:<br><ul><li>there has been a change in circumstances since the original court order was made</li><li>evidence of a substantial nature that was not available during the previous hearing has become available</li><li>evidence of a lack of financial disclosure by a party was discovered after the last order was made</li></ul>",
              "titleLocation": "hidden",
              "messageStyle": "inline",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingOrder'"
            },
            {
              "type": "infotext",
              "name": "ChangeAgreementExplanationFAQ",
              "title": "Family dynamics change and children grow up. An agreement about child support that was made in the past may not make sense anymore. The court can only set aside or replace an agreement if the court would make an order for child support that is different from the agreement on consideration of the matters set out in section 150 [<i>determining child support</i>] of the <a href=\"https://www.bclaws.ca/civix/document/id/complete/statreg/11025_07#section150\" target=\"blank\">Family Law Act</a>. <br><br>Section 150 of the Family Law Act says that a court must consider the Child Support Guidelines when making an order about child support but may consider an amount different from the Child Support Guidelines if satisfied that:<ul><li>the agreement about child support establishes reasonable arrangements for support of the child despite the amount being different from the Child Support Guidelines amount, or</li><li>applying the Child Support Guidelines would be inequitable on consideration of:<ul><li>an agreement or order respecting the financial duties of the parents or guardians or the division or transfer of property, other than an agreement about child support, benefits the child directly or indirectly, or</li><li>special provisions have otherwise been made for the benefit of the child</li></ul></ul>",
              "titleLocation": "hidden",
              "messageStyle": "inline",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingAgreement'"
            },
            {
              "type": "multiplecommentcheckbox",
              "name": "changesSinceOrderList",
              "title": "Explain to the court what has changed that makes the existing order no longer appropriate.",
              "description": "Select each option that fits your situation and provide the additional detail as required.",
              "choices": [
                {"value":"myFinancialChanged",    "comment":false, "text":"My financial situation has changed"},
                {"value":"partyFinancialChanged", "comment":false, "text":"I believe the other party’s financial situation has changed"},
                {"value":"expensesChanged",       "comment":true,  "text":"The `special and extraordinary expenses` have changed as follows:"},
                {"value":"arrangementsChanged",   "comment":true,  "text":"The living arrangements for a child have changed as follows:"},
                {"value":"newInformation",        "comment":true,  "text":"Information has become available that was not available when the order was made (specify what information)"},
                {"value":"other",                 "comment":true,  "text":"Other changes or circumstances as follows:"}
              ],
              "isRequired": true,
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingOrder'"
            },
            {
              "type": "comment",
              "name": "changesSinceAgreement",
              "title": "Explain to the court why you believe the agreement should be set aside or replaced.",
              "description": "You do not need to use any special wording. The key is to be as clear as possible.",
              "isRequired": true,
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingAgreement'"
            },        
            {
              "type": "radiogroup",
              "name": "orderDifferenceType",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingOrder'",
              "title": "Do you want the existing order changed, suspended or cancelled?",
              "description": "You can apply to change the existing order if you still need an order about child support, but you want something different. Or you can apply to cancel the existing order.<br>Select the option that fits your situation.",
              "choices": [
                {
                  "value": "changeOrder",
                  "text": "Change"
                },
                {
                  "value": "suspendedOrder",
                  "text": "Suspended"
                },
                {
                  "value": "cancelOrder",
                  "text": "Cancel"
                }
              ]
            },
            {
              "type": "radiogroup",
              "name": "agreementDifferenceType",
              "visible": false,
              "visibleIf": "{existingType} = 'ExistingAgreement'",
              "title": "Do you want the existing written agreement set aside or replaced?",
              "description": "You can apply to set aside (cancel) the existing agreement or to replace it with a child support order if you believe you need something different.",
              "choices": [
                {
                  "value": "setAsideAgreement",
                  "text": "Set aside"
                },
                {
                  "value": "replacedAgreement",
                  "text": "Replace"
                }
              ]
            }
          ]
        }
      ],
      "title": "About the existing order or written agreement"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}