{
  "title": "Child Support Current Arrangement",
  "pages": [
    {
      "name": "Child Support ",
      "elements": [
        {
          "type": "panel",
          "name": "TimeWithChildPanel",
          "elements": [           
            {
              "type": "infotexttitle",
              "name": "TimeWithChildHelp", 
              "title": " ",                          
              "description":"<b style='font-size:20px;' >Time with a child</b><br>The amount of time a child spends with each parent or guardian may determine who may be required to pay child support. The time a child spends with each parent or guardian includes the time that they are responsible for the child, even if the child is not physically with them.",
              "messageStyle": "inline"
            },
            {
              "type": "comment",
              "name": "applicantTimeWithChildExplanation",
              "isRequired": true,
              "title":"Please describe how the {childWording} time with you and the other party.",
              "description":"If the child divides their time between more than one parent or guardian try to describe the amount of time they spend with each parent over a period of one year. If you can estimate a percentage of time, it is helpful for the court. For example, if they live two days a week with one parent and the rest with the other, they live approximately 30% of the time with the first parent and 70% with the other.<br><br>If you have more than one child and the time spent with each child is different, try to be clear about the amount of time a time each child spends with each parent."             
            },
            {
              "type": "yesno",
              "name": "applicantTimeType",
              "title":"Based on your answer, would you describe the parenting time as `split` or `shared`?",
              "isRequired": true              
            },
            {
              "type": "helptext",
              "name": "FAQTimewithchild",
              "title": "What if the parenting time arrangements are different for each child?",
              "body": "It is possible that you will have different parenting time arrangements for each child. If that is the case, figuring out child support could be more complex and you may want to talk to a lawyer or family justice counsellor to help you with your specific situation. If you would describe the parenting time arrangement for any child as split or shared, select Yes for this question.",
              "titleLocation": "hidden"
            },
            {
              "type": "infotext",
              "name": "parentFileForm4Info",
              "visible":false,
              "visibleIf":"{applicantTimeType} == 'y'",
              "title": "You are required to file a Financial Statement in Form 4 with your application for an order about child support. You will be reminded to include a copy at the end of the service.",            
              "titleLocation":"hidden",
              "messageStyle": "info"
            }
          ]
        },
        {
          "type": "panel",
          "name": "arrangmentPanel",          
          "elements": [           
            {
              "type": "infotexttitle",
              "name": "TimeArrangmentHelp", 
              "title": " ",                          
              "description":"<b style='font-size:20px;' >Child Support arrangements</b>",
              "messageStyle": "inline"
            },
            {
              "type": "comment",
              "name": "currentArrangmentExplanation",
              "isRequired": true,
              "title":"Please describe the current support arrangements.",
              "description":"You do not need to use any special wording. Just explain to the court how the child is currently being looked after financially. Include:  how much money are you receiving or paying for the support of the child, how often and when did these payments begin or stop."             
            }
          ]
        }
      ],
      "title": "Current Arrangement"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}