{
  "title": "Special And Extraordinary Expenses",
  "pages": [
    {
      "name": "Special And Extraordinary Expenses",
      "elements": [
        {
          "type": "infotext",
          "name": "topicDescription",
          "title": "<b style='font-size:16px; font-weight:normal;'>Special and extraordinary expenses are costs of raising a child that go above and beyond what is covered by the guideline table amount for child support. Section 7 of the <a href='https://laws-lois.justice.gc.ca/eng/regulations/SOR-97-175/index.html' target='_blank'>Federal Child Support Guidelines</a> say that each parent or guardian must help pay for the special and extraordinary expenses for a child.<br><br> Special and `extraordinary` expenses are:<ul><li>childcare expenses that you may have to pay because of a job, an illness, a disability, or educational requirements for employment if your child spends most of the time with you</li><li>the portion of your medical and dental insurance premiums that provides coverage for your child</li><li>your child’s healthcare needs that exceed $100 per year if the cost is not covered by insurance (for example, orthodontics, counselling, medication, or eye care)</li><li>expenses for post-secondary education</li><li>extraordinary expenses for your child’s primary education, secondary education or any other educational programs that meet your child’s particular needs</li><li>extraordinary expenses for your child’s extracurricular activities</li></ul>Usually, the amount is shared in proportion to the incomes of the parents or guardians. Either parent or guardian can claim special and extraordinary expenses. <br><br>For more information, please see the fact sheet <a href='https://familylaw.lss.bc.ca/resources/fact_sheets/child_support.php' target='_blank'>Child Support</a> by Legal Aid BC or talk to a lawyer, family justice counsellor, or child support officer. </b>",
          "titleLocation": "hidden",
          "messageStyle": "inline"
        },
        {
          "type": "panel",
          "name": "expensePanel",
          "elements": [
            {
              "type": "yesno",
              "name": "applyForExtraordinaryExpenses",
              "title": "Are you applying for an order for special and extraordinary expenses for a child?",
              "isRequired": true
            },
            {
              "type": "infotext",
              "name": "parentFileForm4Info2",
              "visible": false,
              "visibleIf": "{applyForExtraordinaryExpenses} == 'y'",
              "title": "You are required to file a Financial Statement in Form 4 with your application for an order about child support. You will be reminded to include a copy at the end of the service.",
              "titleLocation": "hidden",
              "messageStyle": "info"
            }
          ]
        },
        {
          "type": "html",
          "visible": false,
          "visibleIf": "{applyForExtraordinaryExpenses} == 'y'",
          "html": "<div style='margin-bottom:-0.75rem'><div style='font-weight: bold;font-size: 1.75em;' class='sv_main sv_q_title'>Please complete the table below for all special and extraordinary expenses you are including in your application.</div>To determine a specific amount for each special or extraordinary expense, you will need to consider any subsidies, benefits or income tax deductions or credits relating to each expense and your eligibility to claim these amounts. The amount you include in the table should be the actual amount being paid by you or the other party for the expense.<br><br>You do not need to attach receipts to your application but you may be required to provide them to the other party and the court later. You should get them organized and have them ready in case you are asked.</div></div>"
        },
        {
          "type": "radiogroup",
          "name": "extraordinaryExpensesTable",
          "title": "Special and Extraordinary Expense:",
          "visible": false,
          "visibleIf": "{applyForExtraordinaryExpenses} == 'y'",
          "titleLocation": "hidden"
        }
      ],
      "title": "Special And Extraordinary Expenses"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}