{
  "explosive substance": "An **explosive substance** includes

  - (a) anything intended to be used to make an explosive substance,
  - (b) anything, or any part thereof, used or intended to be used, or adapted to cause, or to aid in causing an explosion in or with an explosive substance, and
  - (c) an incendiary grenade, fire bomb, molotov cocktail or other similar incendiary substance or device and a delaying mechanism or other thing intended for use in connection with such a substance or device; (substance explosive)",

  "firearm": "A **firearm** means a barrelled weapon from which any shot, bullet or other projectile can be discharged and that is capable of causing serious bodily injury or death to a person, and includes any frame or receiver of such a barrelled weapon and anything that can be adapted for use as a firearm; (arme à feu)",

  "weapon": "A *weapon* means any thing used, designed to be used or intended for use

  - (a) in causing death or injury to any person, or
  - (b) for the purpose of threatening or intimidating any person
  
  and, without restricting the generality of the foregoing, includes a firearm and, for the purposes of sections 88, 267 and 272, any thing used, designed to be used or intended for use in binding or tying up a person against their will; (arme)
  
  Click [here for more information](http://laws-lois.justice.gc.ca/eng/acts/C-46/page-1.html).",

  "Children": "Under the age of 19 or special circumstance such as disability or university tuition, **NEEDS A WAY BETTER EXPLANATION**",

  "Child": "Under the age of 19 or special circumstance such as disability or university tuition, **NEEDS A WAY BETTER EXPLANATION**",

  "Family Law Protection Order": "A **Family Law Protection Order** is a court order to protect one family member from another family member if there is a risk of violence. The protection order limits or prohibits contact or communications between family members where there are safety concerns. It is a criminal offense for the person named in the order to disobey (“breach”) it.
  
  Click [here for more information](https://www2.gov.bc.ca/gov/content/life-events/divorce/family-justice/keeping-your-family-safe/protection-order)",

  "Family Member": "**TO BE ADDED**",

  "Family Violence": "**Family violence** includes physical, sexual, and psychological or emotional abuse of a family member. Psychological or emotional abuse includes intimidation, harassment, coercion, threats, financial abuse, stalking, and intentional damage to property. In the case of a child, it includes witnessing or being exposed to family violence. Family violence does not include self-defence.",

  "Peace Bond": "A **peace bond** is another type of protection order available in criminal court to limit or prohibit contact or communications between people where there is a safety risk.",

  "Personal Belongings": "**TO BE ADDED**",

  "Protection Order": "**TO BE ADDED**"
}
