{
  "title": "Existing written agreement - Property division in respect of a companion animal",
  "pages": [
    {
      "name": "Existing written agreement - Property division in respect of a companion animal",
      "description": "A companion animal is often a family pet. Section 1 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a> defines a companion animal as an animal that is kept primarily for the purpose of companionship. Section 3.1 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section3' target='_blank'>Family Law Act</a> states that a companion animal is not:<ul class='mt-2'><li>a guide dog or service dog within the meaning of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/15017' target='_blank'>Guide Dog and Service Dog Act</a>;</li><li>an animal that is kept as part of a business;</li><li>an animal that is kept for agricultural purposes.</li></ul>",
      "elements": [        
        {
          "type": "html",
          "name": "companionAnimalDesciption",
          "visible": true,
          "html": "Property division in respect of a companion animal is who will have ownership and possession of a companion animal when spouses separate. The court may only make an order for ownership and possession of a companion animal <b>by one spouse</b>, but spouses may agree out of court to share ownership and possession of a companion animal."
        },       
        {
          "type": "helptext",
          "name": "FAQPossessionCompanion",
          "title": "I want to share ownership and possession of our companion animal. How can we reach an agreement?",
          "titleLocation": "hidden",
          "body": "Section 92 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_05#section92' target='_blank'>Family Law Act</a> provides that spouses may make agreements respecting the division of property, including agreements to: <ul><li>jointly own a companion animal, </li><li>share possession of a companion animal, or</li><li>give exclusive ownership or possession of a companion animal to one of the spouses.</li></ul> If you and your spouse want to try to reach an agreement about a companion animal, including an agreement to share ownership or possession, you can find more information about how to reach an agreement on the <a href='https://www2.gov.bc.ca/gov/content?id=2E2E5D3F5CDB44618BE43EEDE79B6DBB' target='_Blank'>BC Government website</a>."
        },
        {
          "type": "html",
          "name": "courtOrderDesciption",
          "visible": true,
          "html": "If you want a court order about property division in respect of a companion animal, this pathway will help you complete the form to make your application."
        },
        {
          "type": "text",
          "name": "agreementDate",
          "title": "Please provide the date the written agreement was signed.",
          "isRequired": true,
          "inputType": "date"
        },
        {
          "type": "infotext",
          "name": "RequiredDocuments1",
          "title": "You will be reminded to include a copy at the end of the service.",
          "titleLocation": "hidden",
          "visible": true,
          "messageStyle": "info"
        },
        {
          "type": "html",
          "name": "setAsideAgreementDesciption",
          "visible": true,
          "html": "<div class='mb-n3'>The <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a> has rules about setting aside or replacing an agreement about property division with a new order. The court may set aside an agreement about property division in respect of a companion animal or set aside and replace an agreement about property division in respect of a companion animal with an order made under Division 4 of Part 5 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a> if:"
        },
        {
          "type": "html",
          "name": "setAsideAgreementDetailsDesciption",
          "visible": true,
          "html": "<ul><li>the court is satisfied that one or more of the following circumstances [set out in section 93(3) of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a>] existed at the time the parties entered into the agreement: <ul><li>a spouse failed to disclose significant property or debts, or other information relevant to the negotiation of the agreement;</li><li>a spouse took improper advantage of the other spouse's vulnerability, including the other party's ignorance, need or distress;</li><li>a spouse did not understand the nature or consequences of the agreement;</li><li>other circumstances that would under the common law cause all or part of a contract to be voidable; and the court would not make a different order on consideration of all the evidence, or;</li></ul></li><li>on consideration of the following matters [set out in in section 93(5) of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a>], the court is satisfied that the agreement is significantly unfair:</li><ul><li>the length of time that has passed since the agreement was made;</li><li>the intention of the spouses, in making the agreement, to achieve certainty;</li><li>the degree to which the spouses relied on the terms of the agreement.</li></ul></li></ul>"          
        },
        {
          "type": "comment",
          "name": "setAsideReason",
          "visible": true,              
          "title": "Explain to the court why you believe the agreement should be set aside or replaced.",
          "description": "You do not need to use any special wording. The key is to be as clear as possible.",
          "isRequired": true
        },
        {
          "type": "helptext",
          "name": "FAQLegalAdvice",
          "title": "Where can I get legal assistance?",
          "titleLocation": "hidden",
          "body": "Understanding the law and making sure you get correct information is important. If you get the wrong information or do not know how the law applies to your situation, it can be harder to resolve your case. Getting advice from a lawyer can help.<br/><br/><b>Lawyers:</b> To find a lawyer or to have a free consultation with a lawyer for up to 30 minutes, contact the <a href='https://www.cbabc.org/For-the-Public/Lawyer-Referral-Service' target='blank'>Lawyer Referral Service</a> at 1-800-663-1919<br/><br/><b>Legal Aid, Duty Counsel and Family Advice Lawyers:</b> To find out if you qualify for free legal advice or representation, contact <a href='https://lss.bc.ca/legal_aid/howToApply.php' target=\"blank\">Legal Aid BC</a> at <p style='display:inline-block'>1-866-577-2525.</p><br/><b>Legal Services and Resources:</b> Visit <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">Clicklaw</a> at <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">www.clicklaw.bc.ca/helpmap</a> to find other free and low-cost legal services in your community"
        },
        {
          "type": "radiogroup",
          "name": "existingAgreementDecision",              
          "title": "Do you want the existing written agreement set aside or replaced?",
          "description": "You can apply to set aside (cancel) the existing agreement or to replace (change) the existing agreement with a court order if you need a different property division order respecting a companion animal. Select the option that fits your situation.",
          "hasOther": false, 
          "isRequired": true,                   
          "choices": [
            {
              "value": "SetAside",
              "text": "Set aside"
            },
            {
              "value": "Replaced",
              "text": "Replaced"
            }
          ]
        },
        {
          "type": "comment",
          "name": "agreementReplacement",
          "visible": false,
          "visibleIf": "{existingAgreementDecision}='Replaced'",              
          "title": "I am applying for the agreement about a companion animal to be replaced with an order as follows:",
          "description": "Remember the court may only make an order for ownership and possession of a companion animal by <b>one spouse</b>. Under section 97 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_01#section1' target='_blank'>Family Law Act</a>, the court cannot declare that the spouses jointly own the companion animal, or require the spouses to share possession of the companion animal.<br><br>You do not need to use any special wording. The key is to be clear about the order you want the court to make. Be sure to include the name of the companion animal and who you want to have ownership and possession of the animal.<br><br>The Provincial Court’s <a href='https://www.provincialcourt.bc.ca/downloads/family/Standard Wording of Family Court Orders - January 2022.docx' target='_Blank'>Family Law Act Picklist</a> includes commonly used order terms that might be helpful.",
          "isRequired": true
        }
      ],
      "title": "Existing written agreement - Property division in respect of a companion animal"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}