{
    "title": "Provincial Court Family Law Act Protection Order",
    "pages": [
     {
      "name": "Urgency",
      "elements": [
       {
        "type": "infotext",
        "name": "urgencyPOInfo",
        "title": "Normally, you need to give notice to the other party that you are applying for a `Protection Order`. You give notice to the other party by having the application documents served personally to them.\n<br>\n<br>\nA judge can decide to review your application without the other party being given notice until after the Protection Order is made if notice on the other party is unreasonable because of special circumstances like you or your children are in imminent danger of harm, or providing notice in advance would probably have serious consequences.\n<br>\n<br>\nA judge can also decide to change the amount of notice you give the other party if the judge decides the other party should be served before making a decision about the protection order but your situation requires a court order sooner than 7 days.\n<br>\n<br>\nThe period of time between the day that the other party is served and the day that the application is heard is called the \"notice period\" or \"notice\".\n<br>\nNormally, you must serve the other party with at least 7 days' notice of the court appearance. If you serve the other party with less than 7 days’ notice, the court will decide if the amount of notice you gave was reasonable and if a protection order should be made without proper notice or without the other party being present in court to tell their story.",
        "titleLocation": "hidden"
       },       
       {
        "type": "yesno",
        "name": "PORNoNotice",
        "title": "Do you want a judge to make their decision before the other party gets to tell their story?",
        "isRequired": true
       },
       {
        "type": "comment",
        "name": "PORWhyNoNotice",
        "visibleIf": "{PORNoNotice} = 'y'",
        "isRequired": true,
        "title": "Tell the court why the application or your situation is urgent and what you believe will happen if the other party is served with the application and given a chance to attend court so that you can both be heard at the same time.",
        "description": "Provide the facts you want the court to consider, including:\n<br>\n<ul>\n<li>why the other party should not be given notice?</li>\n<li>why the application or your situation is urgent or what special circumstances exist?</li>\n<li>what do you believe will happen if the other party is served or given notice of your application and a chance to attend court at the same time as you?</li>\n</ul>"
       },
       {
        "type": "infotext",
        "name": "urgencyPONoticeInfo",
        "visibleIf": "{PORNoNotice} = 'n'",
        "title": "You must arrange for personal service of a copy of this application and any supporting documents on the other party. Personal service means that the documents must be given to them by an adult person other than you who is at least 19 years old.\n<br>\nThe person serving the documents must complete a Certificate of Service so that you can prove personal service of the documents took place.",
        "titleLocation": "hidden"
       }
      ],
      "title": "Urgency"
     }
    ],
    "showQuestionNumbers": "off",
    "requiredText": ""
   }