{
   "pages": [
      {
         "name": "Administrative Forms Submission",
         "description": "This service is to be used when submitting an administrative form. You can also complete the form and either file in person at the registry counter or submit via mail.<b>Note:</b> The current size limit for this service is 10MB.",
         "elements": [
            {
               "type": "panel",
               "name": "QualificationPanel",
               "elements": [
                  {
                     "type": "yesno",
                     "name": "ExistingFamilyCase",
                     "isRequired": true,
                     "title": "Is there already a Family Law file open between the same parties in the Provincial Court of British Columbia?",
                     "description": "An open file could mean that documents have been filed at the courthouse but a judge may not have made an order yet."
                  },
                  {
                     "type": "helptext",
                     "name": "ExistingFamilyCaseFAQ1",
                     "title": "If I have a Family Law file open in the Supreme Court of British Columbia, should I include that?",
                     "titleLocation": "hidden",
                     "body": "No, the file numbers are different between Provincial and Supreme Court. If you already have a Provincial Court file number, you will want to make sure that this document gets filed with the same file number."
                  },
                  {
                     "type": "helptext",
                     "name": "ExistingFamilyCaseFAQ2",
                     "title": "What if I already have a Family Law file open with different parties?",
                     "titleLocation": "hidden",
                     "body": "If you have a Family Law file open with different parties, select no. You will need to open a new court file. You must follow the rules about which registry to use if you do not have an existing case with the same parties. The next questions will help you determine the correct court location, it may be the same one your case with other parties is already at."
                  },                  
                  {
                     "type": "yesno",
                     "name": "PreviouslyRejected",
                     "visible": false,
                     "isRequired": true,
                     "title": "Are you submitting a package that was previously rejected?"
                  },
                  {
                     "type": "infotext",
                     "name": "ExplanationPreviouslyRejected",
                     "visible": false,                     
                     "title": "If you are submitting documents that were previously rejected by the registry please use the <a  href='https://justice.gov.bc.ca/cso/index.do' target='_blank'>CSO website</a> to resubmit your documents.",
                     "titleLocation": "hidden"
                  }
               ]
            }
         ],
         "title": "Administrative Forms Submission"
      }
   ],
   "showQuestionNumbers": "off",
   "requiredText": ""
}