{
  "title": "Reply New Child Support",
  "pages": [
    {
      "name": "Reply New Child Support",
      "elements": [
        {
          "type": "infotext",
          "name": "childSupportDescription",
          "title": "The other party has made an application for an order about child support.<br><br>Child support is the amount of money a parent or guardian pays to another parent or guardian to help care for the child. A child has the right to be supported by both parents, whether the parents ever lived together, or the parent has ever lived with the child.<br><br>Although parents have the primary responsibility to pay child support, other guardians and step-parents may be responsible for paying child support. If you are a step-parent, and you need more information about step-parents and child support, see the fact sheet <a target='_blank' href='https://familylaw.lss.bc.ca/resources/fact_sheets/step_parents_rights.php'>Step-parents Rights and Responsibilities by Legal Aid BC.</a><br><br>For more information about child support and referrals to other child support resources, visit the <a target='_blank' href='https://www2.gov.bc.ca/gov/content?id=9FC4E697F0204229BE702F32475C9107'>BC Government website</a> at <a target='_blank' href='http://www.gov.bc.ca'>www.gov.bc.ca</a>.<br><br>The details of the order the other party is asking for can be found in <b>Schedule 3 – Child Support – New</b> of their Application About a Family Law Matter. You will need to refer to their application for these next questions.",
          "messageStyle": "inline",
          "titleLocation": "hidden"
        },
        {
          "type": "panel",
          "name": "NewChildSupportPanel",
          "elements": [
          
            {
              "type": "yesno",
              "name": "agreeCourtOrder",
              "title": "Do you agree the court should make the order?",
              "description": "Look at the order the other party is applying for. Their order may be set out in their response to <b>Questions 7 to 12</b> on <b>Schedule 3 – Child Support – New</b>. Should the court make the order?<br><br>If you agree to only part of the order, for example, you agree to pay child support monthly but not the amount they’ve set out, select NO. This service will help you to explain why the order should be different.",
              "isRequired": true
            }
          ]
        }
   
      ],
      "title": "Reply New Child Support"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}