{
   "title": "Provincial Court Family Law Act Protection Order",
   "pages": [
      {
         "name": "AdditionalDocs",
         "elements": [
            {
               "type": "panel",
               "name": "additionalDocsPanel",
               "elements": [
                  {
                  "type": "html",
                  "name": "additionalDocsExplanation",
                  "html": "Based on your answers, you must file the following additional documents with your Reply to an Application About a Family Law Matter:<ul><li>Completed <a target='_blank' href='https://www2.gov.bc.ca/assets/gov/law-crime-and-justice/courthouse-services/court-files-records/court-forms/family/pfa713.pdf?forcedownload=true'>Financial Statement Form 4</a></li></ul>If you do not give your complete, true, and up-to-date financial information when needed, the court can:<ul><li>order that the income information be provided</li><li>assume a party’s income is a certain amount for support purposes and make an order based on it</li><li>require a party to give security</li><li>require a party to pay the other party’s expenses, an amount to the other party up to $5,000, or a fine up to $5,000</li><li>make any other order the court considers appropriate</li></ul>"
                  },
                  {
                     "type": "yesno",
                     "name": "isFilingAdditionalDocs",
                     "title": "Will you be able to file the required additional forms with your reply?",
                     "description": "Note: This service does not currently support the completion of the forms listed above. You can complete the fillable PDFs and upload them during the Review and File step to file with this service.",
                     "isRequired": true
                  },
                  {
                     "type": "helptext",
                     "name": "fileApplicationFAQ",
                     "title": "What happens if I can’t file the form with my reply?",
                     "titleLocation": "hidden",
                     "body": "You may still be allowed to file your reply without the required additional forms listed above, but you will need permission from the court to do so. To get permission, you must complete an Application for Case Management Order Without Notice or Attendance Form 11. If you select case management order in Step 1 Get Started, this service will help complete the form."
                  }                             
               ]
            }            
         ],
         "title": "Additional Forms to File"
      }
   ],
   "showQuestionNumbers": "off",
   "requiredText": ""
}