{
  "title": "Property Division Order",
  "pages": [
    {
      "name": "PropertyDivisionOrder",
      "description": "You have said you disagree with the property division in respect of a companion animal the other party is asking the court to order, now you can tell the court what order you think should be made instead.<br><br> Remember the court may only make an order for ownership and possession of a companion animal <b>by one spouse.</b> Under section 97 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_05#section97' target='_blank'>Family Law Act</a>, the court cannot declare that the spouses jointly own the companion animal, or require the spouses to share possession of the companion animal.",
      "elements": [
        {
          "type": "helptext",
          "name": "FAQPossessionCompanion",
          "title": "I want to share ownership and possession of our companion animal. How can we reach an agreement?",
          "titleLocation": "hidden",
          "body": "Section 92 of the <a href='https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/11025_05#section92' target='_blank'>Family Law Act</a> provides that spouses may make agreements respecting the division of property, including agreements to: <ul><li>jointly own a companion animal, </li><li>share possession of a companion animal, or</li><li>give exclusive ownership or possession of a companion animal to one of the spouses.</li></ul> If you and your spouse want to try to reach an agreement about a companion animal, including an agreement to share ownership or possession, you can find more information about how to reach an agreement on the <a href='https://www2.gov.bc.ca/gov/content?id=2E2E5D3F5CDB44618BE43EEDE79B6DBB' target='_Blank'>BC Government website</a>."
        },           
        {
          "type": "panel",
          "name": "DisagreePropertyDivisionPanel",
          "elements": [            
            {
              "type": "comment",
              "name": "propertyDivisionCourtOrderBelief",
              "title": "I believe the court should make the following order for property division in respect of a companion animal:",
              "description": "You do not need to use any special wording. The key is to be clear about the order you want the court to make instead. If you are asking for an order for ownership and possession of a companion animal, be sure to include the name of the companion animal and who you want to have ownership and possession of the animal.",
              "isRequired": true
            }
          ]
        }
      ],
      "title": "Property Division Order"
    }
  ],
  "showQuestionNumbers": "off",
  "requiredText": ""
}