{
   "title": "Provincial Court Family Law Act Protection Order",
   "pages": [
      {
         "name": "Questionnaire",
         "elements": [
            {
               "type": "panel",
               "name": "QuestionnairePanel",
               "elements": [
                  {
                     "type": "infotext",
                     "name": "childInfoAckknowledge",
                     "title": "I understand that I must consider the child(ren)'s best interests with respect to each order about the child I am asking the court to make.  ",
                     "titleLocation": "hidden",
                     "messageStyle": "inline"
                  },
                  {
                     "type": "helptext",
                     "name": "FAQLegalAdvice",
                     "title": "Where can I get legal assistance?",
                     "titleLocation": "hidden",
                     "body": "Understanding the law and making sure you get correct information is important. If you get the wrong information or do not know how the law applies to your situation, it can be harder to resolve your case. Getting advice from a lawyer can help.<br/><br/><b>Lawyers:</b> To find a lawyer or to have a free consultation with a lawyer for up to 30 minutes, contact the <a href='https://www.cbabc.org/For-the-Public/Lawyer-Referral-Service' target='blank'>Lawyer Referral Service</a> at 1-800-663-1919<br/><br/><b>Legal Aid, Duty Counsel and Family Advice Lawyers:</b> To find out if you qualify for free legal advice or representation, contact <a href='https://lss.bc.ca/legal_aid/howToApply.php' target=\"blank\">Legal Aid BC</a> at <p style='display:inline-block'>1-866-577-2525.</p><br/><b>Legal Services and Resources:</b> Visit <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">Clicklaw</a> at <a href='https://www.clicklaw.bc.ca/helpmap' target=\"blank\">www.clicklaw.bc.ca/helpmap</a> to find other free and low-cost legal services in your community"
                  },
                  {
                     "type": "yesno",
                     "name": "ExistingOrdersFLM",
                     "title": "Are there any existing written agreements or court `orders` about parenting arrangements, `child support`, contact with a child, guardianship of a child?",
                     "description": "A written agreement includes a separation agreement or mediation agreement. A court order may be from any court in any place, including the Supreme Court.",
                     "isRequired": true
                  },
                  {
                     "type": "infotext",
                     "name": "attachCopyOfExistingOrders",
                     "visible": false,
                     "visibleIf": "{ExistingOrdersFLM} = 'y'",
                     "title": "You will need to include a copy of your written agreement(s) or court order(s) when you file your documents. You will be reminded to include a copy at the end of the service.",
                     "titleLocation": "hidden"
                  },
                  {
                     "type": "yesno",
                     "name": "existingCourtProceeding",
                     "title": "Is there any other court proceeding that is pending or that has been initiated about parenting arrangements, contact with a child or guardianship of a child who is the subject of this application?",
                     "description": "This includes:<ul><li>any court proceeding from the Provincial Court of BC including another from another court registry, child protection proceedings or criminal proceedings</li><li>any court proceeding from BC Supreme Court or BC Court of Appeal</li><li>any court proceeding from another province or territory in Canada</li><li>any court proceeding from another country</li></ul>",
                     "isRequired": true
                  },
                  {
                     "type": "comment",
                     "name": "existingCourtProceedingDetails",
                     "visible": false,
                     "visibleIf": "{existingCourtProceeding} = 'y'",
                     "title": "I know the following information about another court proceeding:",
                     "description": "You do not need to use any special wording. Describe any details you know about the other court proceeding including the name of the court or type of court, the parties involved, what the court proceeding is about and what step it may be at.",
                     "isRequired": true
                  }
               ]
            }
         ],
         "title": "Questionnaire"
      }
   ],
   "showQuestionNumbers": "off",
   "requiredText": ""
}